create_clock -period 10 -waveform { 0 5 } [get_ports {clk}]
set_output_delay -clock clk 1.0000 [get_ports {rx_pol}]
set_output_delay -clock clk 1.0000 [get_ports {tx_detect_rx}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_elec_idle}]
set_input_delay -clock clk 1.0000 [get_ports {rx_elec_idle}]
set_driving_cell -lib_cell INVX8 [get_ports {nrst}]
set_input_delay -clock clk 1.0000 [get_ports {nrst}]
set_output_delay -clock clk 1.0000 [get_ports {tx_elec_idle}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_valid}]
set_input_delay -clock clk 1.0000 [get_ports {rx_valid}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data_k}]
set_output_delay -clock clk 1.0000 [get_ports {power_down[0]}]
set_output_delay -clock clk 1.0000 [get_ports {power_down[1]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_comp}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_status[0]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_status[1]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_status[2]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_status[0]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_status[1]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_status[2]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data_k}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data_k}]
set_driving_cell -lib_cell INVX8 [get_ports {clk}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[0]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[1]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[2]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[3]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[4]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[5]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[6]}]
set_output_delay -clock clk 1.0000 [get_ports {tx_data[7]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[0]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[1]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[2]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[3]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[4]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[5]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[6]}]
set_driving_cell -lib_cell INVX8 [get_ports {rx_data[7]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[0]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[1]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[2]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[3]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[4]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[5]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[6]}]
set_input_delay -clock clk 1.0000 [get_ports {rx_data[7]}]
set_driving_cell -lib_cell INVX8 [get_ports {phy_status}]
set_input_delay -clock clk 1.0000 [get_ports {phy_status}]
